src/Enums/ЕдиницыПовторения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ЕдиницыПовторения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ПовторяемостьКлиентСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Единица — День, Неделя, Месяц или Год; Количество — положительное целое число.
// Некорректные аргументы расчётов и конструкторов вызывают исключение.
Функция НовоеПравило(Единица, Количество) Экспорт

	Правило = Новый Структура("Единица, Количество", Единица, Количество);
	ПроверитьПравило(Правило);
	Возврат Правило;

КонецФункции

Функция ПравилоИзПеречисления(ЕдиницаПеречисления, Количество) Экспорт

	Если ТипЗнч(ЕдиницаПеречисления) <> Тип("ПеречислениеСсылка.ЕдиницыПовторения") Тогда
		ВызватьИсключение "Выбери единицу повторения.";
	КонецЕсли;
	Если ЕдиницаПеречисления = ПредопределенноеЗначение("Перечисление.ЕдиницыПовторения.День") Тогда
		Единица = "День";
	ИначеЕсли ЕдиницаПеречисления = ПредопределенноеЗначение("Перечисление.ЕдиницыПовторения.Неделя") Тогда
		Единица = "Неделя";
	ИначеЕсли ЕдиницаПеречисления = ПредопределенноеЗначение("Перечисление.ЕдиницыПовторения.Месяц") Тогда
		Единица = "Месяц";
	ИначеЕсли ЕдиницаПеречисления = ПредопределенноеЗначение("Перечисление.ЕдиницыПовторения.Год") Тогда
		Единица = "Год";
	Иначе
		ВызватьИсключение "Укажи единицу повторения и положительное целое количество.";
	КонецЕсли;
	Возврат НовоеПравило(Единица, Количество);

КонецФункции

Функция ПравилоКорректно(Правило) Экспорт

	Если ТипЗнч(Правило) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	Единица = Неопределено;
	Количество = Неопределено;
	Если Не Правило.Свойство("Единица", Единица) Или Не Правило.Свойство("Количество", Количество) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ТипЗнч(Единица) <> Тип("Строка") Или ТипЗнч(Количество) <> Тип("Число") Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат (Единица = "День" Или Единица = "Неделя" Или Единица = "Месяц" Или Единица = "Год")
		И Количество > 0 И Количество = Цел(Количество);

КонецФункции

Функция СледующаяДата(ДатаОтсчета, Правило) Экспорт

	ПроверитьПравило(Правило);
	ПроверитьДату(ДатаОтсчета);
	Возврат ДатаРяда(ДатаОтсчета, Правило, 1);

КонецФункции

// В ряд входит сама ДатаОтсчета; время суток сохраняется.
Функция БлижайшаяДатаНеРанее(ДатаОтсчета, Правило, НаДату) Экспорт

	ПроверитьПравило(Правило);
	ПроверитьДату(ДатаОтсчета);
	ПроверитьДату(НаДату);
	Если НаДату <= ДатаОтсчета Тогда
		Возврат ДатаОтсчета;
	КонецЕсли;

	Если Правило.Единица = "День" Или Правило.Единица = "Неделя" Тогда
		СекундВИнтервале = Правило.Количество * 86400;
		Если Правило.Единица = "Неделя" Тогда
			СекундВИнтервале = СекундВИнтервале * 7;
		КонецЕсли;
		Номер = Цел((НаДату - ДатаОтсчета) / СекундВИнтервале);
	Иначе
		МесяцевВИнтервале = Правило.Количество;
		Если Правило.Единица = "Год" Тогда
			МесяцевВИнтервале = МесяцевВИнтервале * 12;
		КонецЕсли;
		РазницаМесяцев = (Год(НаДату) - Год(ДатаОтсчета)) * 12 + Месяц(НаДату) - Месяц(ДатаОтсчета);
		Номер = Цел(РазницаМесяцев / МесяцевВИнтервале);
	КонецЕсли;

	// Оценка по интервалам не зависит от расстояния до НаДату; нужна не более одной поправки.
	Кандидат = ДатаРяда(ДатаОтсчета, Правило, Номер);
	Если Кандидат < НаДату Тогда
		Кандидат = ДатаРяда(ДатаОтсчета, Правило, Номер + 1);
	КонецЕсли;
	Возврат Кандидат;

КонецФункции

Функция ПредставлениеПравила(Правило) Экспорт

	ПроверитьПравило(Правило);
	Количество = Правило.Количество;
	Если Количество = 1 Тогда
		Если Правило.Единица = "День" Тогда
			Возврат "Каждый день";
		ИначеЕсли Правило.Единица = "Неделя" Тогда
			Возврат "Каждую неделю";
		ИначеЕсли Правило.Единица = "Месяц" Тогда
			Возврат "Каждый месяц";
		Иначе
			Возврат "Каждый год";
		КонецЕсли;
	КонецЕсли;

	Если Правило.Единица = "День" Тогда
		Формы = СтрРазделить("день,дня,дней", ",");
	ИначеЕсли Правило.Единица = "Неделя" Тогда
		Формы = СтрРазделить("неделю,недели,недель", ",");
	ИначеЕсли Правило.Единица = "Месяц" Тогда
		Формы = СтрРазделить("месяц,месяца,месяцев", ",");
	Иначе
		Формы = СтрРазделить("год,года,лет", ",");
	КонецЕсли;
	Остаток100 = Количество % 100;
	Остаток10 = Количество % 10;
	Индекс = 2;
	Если Остаток100 < 11 Или Остаток100 > 14 Тогда
		Если Остаток10 = 1 Тогда
			Индекс = 0;
		ИначеЕсли Остаток10 >= 2 И Остаток10 <= 4 Тогда
			Индекс = 1;
		КонецЕсли;
	КонецЕсли;
	Возврат "Каждые " + Формат(Количество, "ЧГ=0; ЧДЦ=0") + " " + Формы[Индекс];

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьПравило(Правило)

	Если Не ПравилоКорректно(Правило) Тогда
		ВызватьИсключение "Укажи единицу повторения и положительное целое количество.";
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьДату(Значение)

	Если ТипЗнч(Значение) <> Тип("Дата") Тогда
		ВызватьИсключение "Укажи дату для расчёта повторения.";
	КонецЕсли;

КонецПроцедуры

Функция ДатаРяда(ДатаОтсчета, Правило, Номер)

	Интервал = Правило.Количество * Номер;
	Если Правило.Единица = "День" Тогда
		Возврат ДатаОтсчета + Интервал * 86400;
	ИначеЕсли Правило.Единица = "Неделя" Тогда
		Возврат ДатаОтсчета + Интервал * 7 * 86400;
	ИначеЕсли Правило.Единица = "Месяц" Тогда
		Возврат ДобавитьМесяц(ДатаОтсчета, Интервал);
	Иначе
		Возврат ДобавитьМесяц(ДатаОтсчета, Интервал * 12);
	КонецЕсли;

КонецФункции

#КонецОбласти
